polidat/app/controllers/webhooks_controller.rb

    def create
      event = Event.create!(
        data: params,
        source: params[:source],
      )
---
INSERT INTO "events" ("data", "source", "processing_errors", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)